{
  "education": [
    {
      "institution": "Hack Reactor",
      "degree": "Software Engineering",
      "location": "Los Angeles, CA",
      "dates": "December 2022 – March 2023"
    },
    {
      "institution": "UC Santa Barbara",
      "location": "Santa Barbara, CA",
      "degree": "Bachelor of Arts in Economics",
      "dates": "August 2016 – December 2018"
    }
  ],
  "workExperience": [
    {
      "employer": "Tapestry – COACH New York",
      "location": "New York, NY",
      "title": "Analyst",
      "dates": "April 2021 – June 2022",
      "responsibilities": [
        "Oversaw the P&Ls of multiple business units, including Bags, Ready to Wear, Footwear, Photo Studio, and Merchandise, under Coach Design & Global Marketing.",
        "Collaborated with the design teams to develop and implement cost-saving initiatives.",
        "Conducted detailed P&L breakdowns per category to monitor gross margins and overall performance of individual product lines.",
        "Provided critical data to company executives, working in close collaboration with the CFO, for informed decision-making."
      ]
    },
    {
      "employer": "PNC Bank",
      "location": "Philadelphia, PA",
      "title": "Corporate Banking Analyst",
      "dates": "March 2020 – April 2021",
      "responsibilities": [
        "Collaborated closely with C-level executives, finance managers, and accounting staff to conduct due diligence on potential secured credit commitments, utilizing analytical skills to evaluate and manage company risk profiles.",
        "Conducted thorough collateral audits on existing portfolio companies to recommend adjustments to total credit extension.",
        "Analyzed and interpreted historical performance trends, cash flow strength, collateral coverage, and private equity sponsor involvement, utilizing advanced software tools to calculate key profitability and leverage indicators such as free cash flow, unfunded Capex, and estimated fixed charge coverage ratio."
      ]
    },
    {
      "employer": "Autism Learning Partners",
      "location": "Pasadena, CA",
      "title": "Financial Analyst",
      "dates": "March 2019 – December 2019",
      "responsibilities": [
        "Assisted senior corporate finance analysts in preparing internal monthly operational reports for use by company executive and private equity sponsor group. Reporting breaks down and summarizes key performance indicators and company financials by region for comparison between actual vs. budgeted figures.",
        "Created databases and VBA macros to provide ease of data manipulation for analysis and effectively decreased turnaround time for reporting/analysis."
      ]
    }
  ],

  "projects": [
    {
      "name": "Swapesy",
      "role": "PM/Engineer",
      "description": "A mobile ecommerce app for trading card enthusiasts. Users can interact with each other via our real-time messaging platform and trade/purchase cards.",
      "technologies": ["React Native", "Firebase"],
      "source": "https://github.com/stunningstunfisk/swapesy"
    },
    {
      "name": "AlbumGuessr",
      "role": "Engineer",
      "description": "A web game utilizing Spotify search data, and webplayback SDK. Match the currently played track to the correct album cover, earn points and keep track of the top scorers on the leaderboard",
      "technologies": [
        "Typescript",
        "NextJS",
        "NextAuth",
        "Prisma",
        "React Query",
        "PostgreSQL"
      ],
      "source": "https://github.com/samuelho-dev/spotify-album-guessing-game"
    },
    {
      "name": "SunChip",
      "role": "Engineer",
      "description": "Designed and implemented a secure backend and database for a fashion ecommerce store hosted using AWS EC2. Implemented caching via NGNIX and horizontal scaling via AWS.",
      "technologies": ["Javascript", "Node", "PostgreSQL", "Sequelize", "AWS"],
      "source": "https://github.com/sunChips-mysteryFlavor"
    }
  ]
}
